{
  "id": "687970c3a4ac7ef2a17a6398",
  "lessonNumber": 3,
  "title": "Lesson 3",
  "status": "pending",
  "assignment": {
    "title": "Assignment for Lesson 3",
    "objective": "No objective specified",
    "expectedCapabilities": [],
    "instructions": [],
    "tasks": [
      {
        "taskNumber": 1,
        "title": "Task 1",
        "description": "**NOTE: If the CodeSandbox file gets updated, the code example below may not be up to date.  You can confirm the most recent version of this assignment by clicking this:**\n[Link to CodeSandbox Assignment](https://codesandbox.io/p/sandbox/lesson-3-javascript-objects-2025-hr9j68?file=%2Fsrc%2Findex.mjs)\n\n``` javascript\n//--------------- IMPORTANT!!! ---------------\n\n// Use the keyboard shortcut Alt + Z (for PC) or Option + Z (for Mac) to allow word wrap on this document.  Word wrap breaks the lines so you don't have to keep scrolling left and right to read.\n\n//READ THE INFORMATION IN THE BROWSER WINDOW PANEL ON THE RIGHT BEFORE BEGINNING YOUR ASSIGNMENT!!\n\n//---------- OVERVIEW AND INSTRUCTIONS ----------\n\n//-------------------------------------------\n// LESSON 3 OBJECTS\n//-------------------------------------------\n\n//# JavaScript Objects\n// This is the coding assigment for the third week of the Intro to Programming course from Code the Dream. The concepts touched on in this assignment include:\n//   - Object Basics\n//   - Primitive vs Object Types\n//   - Object Destructuring\n//   - Manipulating Objects\n\n// In this assignment you will write your own code. Your instructions are listed as \"comments\", meaning the instructions are grayed out and start with '//' at the beginning of the line of code. Put your answers immediately below the instructions for each question. As mentioned in the Welcome to week 3 information to the right, you'll need to use console logs for all the questions to check your code output. Using a function in a console.log is very similar to how you were using them with variables last week. To invoke/call the function use the syntax:\n\n//  console.log(\"Q#: \", functionName(anyInput))\n\n// Please be sure to check the output of your called functions and console logs in the Console tab to the bottom right of this screen. If your Console is not showing, click the Inspect Button in the top right (see the Welcome to week 3 information to the right if you need help finding that)  Check to make sure that the output you get in your Console is the expected output.\n\n// ---------- QUESTION 1 ----------\n// Objects are a way to store property:value pairs of data in a variable.  First, create an object called 'myPet'.  Add three properties called 'name', 'species', and 'color' to the 'myPet' object below and assign each of them values.  Use your console.log's to print the values of each property to the console.\n\n// EXAMPLE LOG:\n//    console.log(\"Q1 name: \", myPet.name);\n//    console.log(\"Q1 species: \", myPet.species);\n//    console.log(\"Q1 color: \", myPet.color);\n// EXAMPLE OUTPUT:\n//    Q1 name: Teddy\n//    Q1 species: ferret\n//    Q1 color: brown\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 2 ----------\n// Now let's see how we can use the property:value pairs in template literals.  Create a variable called 'aboutPet' and assign it a template literal that uses the 'myPet' object to make a sentence sharing all the pet details.  The sentence should look something like this: \"Teddy is a brown ferret.\"\n\n// EXAMPLE LOG:\n//    console.log(\"Q2: \", aboutPet);\n// EXAMPLE OUTPUT:\n//    Q2: Teddy is a brown ferret.\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 3 ----------\n// Let's add a method to our object.  Create a method called 'age' that takes no parameters, and uses no outside variables (hint: use 'this').  The method should return the age of the pet in years.\n\n// EXAMPLE LOG:\n//    console.log(\"Q3: \", myPet.age());\n// EXAMPLE OUTPUT:\n//    Q3: 7\n\n// PUT YOUR CODE HERE\n\n// Don't forget your console.logs!\n\n// ---------- QUESTION 4 ----------\n// Now, let's see how we can use data within objects in functions.  Write a function called 'isDog' that takes one object parameter.  In the function, create a variable called 'speciesChecker' and assign it the value 'dog'.  Then, still in the function, return true if the object's species value is equal to the variable 'speciesChecker', or false if not.\n\n// EXAMPLE LOG:\n//    console.log(\"Q4: \", isDog(myPet));\n// EXAMPLE OUTPUT: (if your 'myPet' object from Question 1 is about any animal other than a dog)\n//    false\n// NOTE: if when you made 'myPet' in Question 1, you did put dog as species, you should get true as your output instead.\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 5 ----------\n// Now lets work with date and time\n// Create a function called 'month'.  Inside the function, declare a variable named 'today' that uses the Date object.  Your function should then return only the month of the 'today' variable.  You can return the month as a number\n// STRETCH GOAL: Return the month as a string\n\n// EXAMPLE LOG:\n//    console.log(\"Q5: \", month());\n// EXAMPLE OUTPUT: (Will be different for each class but should be the current month.  For example if you're doing this assignment in January...)\n//    Q5: 01\n//    stretch goal should result in:\n//    Q5: January\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 6 ----------\n// Let's explore dates now.  Create a variable named 'birthday' and assign it the date of your next birthday.  Then create a function called 'birthdayCountdown' that takes birthday as a parameter and returns the number of days until your next birthday.  Remember that you may need to use a particular format for your birthday so you can properly convert the data to something you can use in the function.  CAUTION: 2024 is a leap year!\n\n// STRETCH GOAL: As we mentioned in Question 8, you should consider boundary cases. What if the date wasn't formatted to work with your function?\n\n// EXAMPLE LOG:\n//    console.log(\"Q6: \", birthdayCountdown(birthday));\n// EXAMPLE OUTPUT: (if your next birthday was March 15, 2024 and today was February 3, 2024)\n//    Q6: 41\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 7 ----------\n// If we work with dates, we should work with time also.  Create a variable named 'startTime' and assign it a start time.  Create a variable named 'endTime' and assign it an end time.  Then create a function called 'timeDifference' that takes startTime and endTime as parameters and returns the number of hours and minutes between the start and end times.  Remember that you may need to be careful what format you use when entering times so you can properly convert the data to something you can use in the function.\n\n// STRETCH GOAL: You should consider boundary cases. What if the times are not formatted to work with your function?\n\n// EXAMPLE LOG:\n//    console.log(\"Q7: \", timeDifference(startTime, endTime));\n// EXAMPLE OUTPUT: (if startTime was 12:37pm and endTime was 3:19pm)\n//    Q7: 2 hours and 42 minutes\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 8 ----------\n// Create a function called 'absDiff' that takes 2 parameters and returns the absolute difference between them. For example, if the first parameter is smaller than the second, the first parameter will be subtracted from the second. If the first parameter is larger than the second, the second parameter will be subtracted from the first. If they are both equal, return the first parameter subtracted by the second.  It's important to consider boundary cases - situations that may change how you expect your code to behave.  For this reason, work with same numbers and negative numbers as well to see if you get your absDiff function to calculate the absolute difference regardless of number type.\n\n// EXAMPLE LOG 1:\n//    console.log(\"Q8 first larger: \", absDiff(29, 5));\n// EXAMPLE OUTPUT: (if using the numbers 29 and 5 as in the example log)\n//    Q8 first larger: 24\n// EXAMPLE LOG 2:\n//    console.log(\"Q8 second larger: \", absDiff(3, 16));\n// EXAMPLE OUTPUT: (if using the numbers 3 and 16 as in the example log)\n//    Q8 second larger: 13\n// EXAMPLE LOG 3:\n//    console.log(\"Q8 same nums: \", absDiff(5, 5));\n// EXAMPLE OUTPUT 3: (if using the numbers 5 and 5 as in the example log)\n//    Q8 same nums: 0\n// EXAMPLE LOG 4:\n//    console.log(\"Q8 neg num: \", absDiff(-6, 5));\n// EXAMPLE OUTPUT 4: (if using the numbers -6 and 5 as in the example log)\n//    Q8 neg num: 11\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 9 ----------\n// Create a function called 'convertTemp' that takes 1 temperatue parameter in celsius and return the temperature in Fahrenheit.  Log both the input and output values\n\n// EXAMPLE LOG:\n//    console.log(\"Q9 convertTemp: \", celsiusTemp, convertTemp(celsiusTemp));\n// EXAMPLE OUTPUT:\n//    Q9 convertTemp: 0 32\n// Create logs for several different celsium temperatures\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 10 ----------\n// Create a function called 'reverseString' that takes 1 string parameter and returns the reverseString.  Log both the input and output values\n\n// EXAMPLE LOG:\n//    console.log(\"Q10 reverseString: \", inputString, reverseString(inputString));\n// EXAMPLE OUTPUT:\n//    Q10 reverseString: HelloWorld dlroWolleH\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 11 ----------\n// Declare a variable named \"diameter\" and assign it an integer value. Through a series of math calculations and variables, calculate the \"radius\" (which is half the diameter), the \"circumference\" (which is 2 multiplied by the Math value pi, multiplied by the radius) and the \"area\" (which is the Math value pi, multiplied by the radius squared).\n\n// PUT YOUR CODE HERE\n\n// Don't forget your console.logs!\n\n// ---------- QUESTION 12 ----------\n// Let's make a useful math problem - create a tip calculator! Declare two variables called \"billTotal\" and \"tipPercentage\". Assign billTotal a floating point number with two decimal places. Assign tipPercentage a floating point number between 0.1 and 0.9. Create a third variable called \"tip\" that will multiply tipPercentage and billTotal then use the addition assignment operator to add that amount back to billTotal. Example: if our bill 35.75 and we want to leave a 20% tip (0.2) our new billTotal should come out to 42.90.\n\n// PUT YOUR CODE HERE\n\n// Don't forget your console.logs!\n\n// ---------- QUESTION 13 ----------\n// Create two variables named 'num1' and 'num2' and assign them integer values. Create a function called 'multiplyThese' that takes 2 parameters and returns the product  of the two parameters (as a reminder, a product is the resulting number when two numbers are multiplied together).\n\n// EXAMPLE LOG:\n//    console.log(\"Q13: \", multiplyThese(num1, num2));\n// EXAMPLE OUTPUT: (if num1 and num2 are 2 and 5 respectively))\n//    Q13: 10\n\n// PUT YOUR CODE HERE\n\n// ---------- QUESTION 14 ----------\n// Building on the last question, create a function called 'getAverage' that takes 2 parameters and returns their average (hint: there is no built-in average operator in JavaScript).  Use the variables (num1 and num2) you created in Question 6 to test your function.  NOTE: In some programming languages, the types of numbers you use in equations can effect what type of number (integer/floating point) you get as a result.  We suggest using 2.0 instead of 2 as you're calculating the average.\n\n// EXAMPLE LOG:\n//    console.log(\"Q14: \", getAverage(num1, num2));\n// EXAMPLE OUTPUT: (based on num1 and num2 above)\n//    Q14: 3.5\n\n// PUT YOUR CODE HERE\n\n```\n",
        "codeExample": "",
        "_id": "687970c3a4ac7ef2a17a639a"
      }
    ],
    "submissionInstructions": "Please submit on time",
    "checklist": [],
    "checkForUnderstanding": []
  },
  "subsections": [
    {
      "subsectionOrder": 1,
      "title": "Lesson 3",
      "content": "You can either use the written Odin Project lessons or the video lessons in Scrimba.\n\nRemember to please go to each link in this list and read through the content on that page. If there are links you are redirected to as you read/work through the content, follow those links as well and read the content there too.\n\n- [The Odin Project – Fundamentals Part 5](https://www.theodinproject.com/lessons/foundations-fundamentals-part-5)\n  - You can skip the section on Intermediate/advanced array magic as we'll be looking at that next week!\n- [V2 Scrimba - JS Deep Dive - Objects & Maps](https://v2.scrimba.com/javascript-deep-dive-c0a/~015)\n- **NOTE: You do NOT have to watch the last three videos in this playlist ( (1) How Maps Can Do What Objects Can't, (2) Challenge: Your First Map, and (3) Improved Methods with Arrow Functions ). Those cover a topic that will NOT be covered in this lesson (i.e. Map).**\n  - **If you are getting an alert \"Only available to subscribers\" you need to be sure your are logged in to Scrimba with the email address we have on file for you, and that you have redeemed the link to free access you were emailed**\n",
      "videoUrl": "",
      "codeExamples": [],
      "externalLinks": [],
      "quizzes": [],
      "_id": "687970c3a4ac7ef2a17a6399"
    }
  ]
}