{
  "id": "687970c4a4ac7ef2a17a63ac",
  "lessonNumber": 8,
  "title": "## The Odin Project Links:",
  "status": "pending",
  "assignment": {
    "title": "Assignment for Lesson 8",
    "objective": "No objective specified",
    "expectedCapabilities": [],
    "instructions": [],
    "tasks": [
      {
        "taskNumber": 1,
        "title": "Task 1",
        "description": "### Get organized and write some code!\n   - [ ] In your GitHub repository, if you have not yet merged your pull request from last week, merge your open lesson-7 pull request by going to the \"Pull Requests\" tab of your repository. Click on your open pull request, then click on the green 'Merge Pull Request\" and confirm the merge. This will update your main branch with the work you did on your lesson-7 branch.\n   - [ ] Open your code editor and, in the terminal, make sure you're on your main branch. If you're still on your lesson-7 branch, you can switch to your main branch by using the git command `git checkout main`.\n   - [ ] Update your local main branch to include your lesson-7 work by pulling your changes from your GitHub repository main. Use the following git command in your terminal to do this: `git pull origin main`\n   - [ ] Still in your terminal, create a new local branch to keep track of just the work you'll do for this assignment by running `git checkout -b lesson-8` in the terminal. Doing this also copies the lesson-7 work you merged to main and pulled to your local machine so now all your branches should be identical on your local machine.\n\n### Assignment: Task List / Deliverables\n#### Create and Load Stylesheet\n   - [ ] Create a **_folder_** called `css` at the same level as your README.md and index.html files\n   - [ ] Inside that folder, create a Cascading Style Sheets (CSS) file called `index.css`\n   - [ ] Open your `index.html` file\n   - [ ] Before the closing `</head>` tag, insert a `<link>` element with a `rel` attribute of \"stylesheet\" and an `href` attribute that specifies the relative path to your CSS file (i.e. `css/index.css`)\n\n#### Write CSS\nFor this assignment, there are some general requirements but the design is up to you! This is your chance to be creative and transform your webpage into a reflection of who you are.  We suggest starting small with background colors, font choices, etc.  Make small changes, confirm they are what you expect, then move on to make another small change.  **TIP:** If you're struggling with visualizing sections of your webpage, put colorful borders around each section so you can see how changing your css code changes a given section.\n   - [ ] Change the background color of the page body\n   - [ ] Change the default text color\n   - [ ] Customize the font family\n     - [ ] STRETCH GOAL (optional):load in a font family from [Google Fonts](https://fonts.google.com/)\n   - [ ] Add spacing (padding/margin) between sections\n   - [ ] Change the alignment of the content of one of your sections\n   - [ ] Change the font size, weight, and color of headings\n   - [ ] Transform the style of your Name at the top of the page\n     - [ ] STRETCH GOAL (optional): add a picture of yourself to HTML and/or CSS (remember to include accessibility aspects if you add any images!)\n   - [ ] Transform the \"Experience\" list items into styled blocks\n   - [ ] Transform the style of the \"Connect\" links\n     - [ ] STRETCH GOAL (optional): make or use social media icons to replace your link text with images\n\n**NOTE:** This is the basic rubric, but we encourage you to think beyond this list and come up with your own ideas to make your webpage unique!\n\n**_By the end of this assignment, you should have basic styling and have changed a minimum of one background color, one font, one text color, the padding and margin of one element, the alignment of one element, the look of the heading elements, the look of your name, the look of list items, the look of links._**\n\n### Backup to the cloud\nOnce you've made the above changes to your repository folder structure and added your css file, follow the below instructions to push a copy from your local machine like you did at the end of last assignment. Make sure your code gets copied to GitHub by adding changes to staging, committing the staged changes, and pushing them from your local machine to GitHub:\n   - [ ] Check the status of the changes you just made (adding and editing the index.css file and the css folder) by running `git status` in your terminal\n   - [ ] Stage all your changes for commit by running `git add .` in your terminal\n   - [ ] Run `git status` again to see how things have changed. You should get a response indicating changes staged for commit.\n   - [ ] Create a commit message for reference. You can use a different message if you wish. Run `git commit -m \"styling added\"`\n   - [ ] Push these changes to your GitHub repository from your local computer by running `git push`\n\n### Submit Assignment\nNow let's make sure that lesson branch will be reviewed.\n   - [ ] Go to your GitHub repository page in your web browser now, and you should see a \"lesson-8 has a recent push\" notice with a green \"Compare & pull request\" button. Click that button\n   - [ ] Feel free to put notes to yourself or notes for your reviewer in the description (be sure you're including any questions to your reviewer in your assignment submission form though!) and click the green \"Create pull request\" button.\n   - [ ] Copy the address of your pull request page (should look like `https://github.com/yourUsername/name-classname/pull/3`) and paste it into your assignment submission form.\n\n### What next?\n   - If you're on track with class, wait to get feedback and/or the email notice that your assignment review is complete before confirming and merging your pull request to the main branch.\n   - If you're behind or are working ahead:\n     - if you're confident your work is accurate, merge your pull request and continue working through class.\n     - if you're not sure about your work this week, schedule a 1:1 session with a mentor and review your work together before merging.\n",
        "codeExample": "",
        "_id": "687970c4a4ac7ef2a17a63ae"
      }
    ],
    "submissionInstructions": "Please submit on time",
    "checklist": [],
    "checkForUnderstanding": []
  },
  "subsections": [
    {
      "subsectionOrder": 1,
      "title": "Lesson 8",
      "content": "You can either use the written Odin Project lessons or the video lessons in Scrimba.\n\nRemember to please go to each link in this list and read through the content on that page. If there are links you are redirected to as you read/work through the content, follow those links as well and read the content there too.\n\n### The Odin Project Links:\n- **[The Odin Project – Intro to CSS](https://www.theodinproject.com/lessons/foundations-intro-to-css)**\n- **[The Odin Project - The Cascade](https://www.theodinproject.com/lessons/foundations-the-cascade)**\n- **[The Odin Project - Inspect HTML and CSS](https://www.theodinproject.com/lessons/foundations-inspecting-html-and-css)**\n- **[The Odin Project – The Box Model](https://www.theodinproject.com/paths/foundations/courses/foundations/lessons/the-box-model)**\n- **[The Odin Project – Block and Inline](https://www.theodinproject.com/paths/foundations/courses/foundations/lessons/block-and-inline)**\n\n### Scrimba Links:\n- **[Scrimba - HTML & CSS Crash Course](https://v2.scrimba.com/html-css-crash-course-c02l/~00)**\n- **[Intro to CSS](https://v2.scrimba.com/html-css-crash-course-c02l/~08)**\n- **[CSS Basics](https://v2.scrimba.com/html-css-crash-course-c02l/~09)**\n- **[Internal CSS](https://v2.scrimba.com/html-css-crash-course-c02l/~0f)**\n- **[External CSS](https://v2.scrimba.com/html-css-crash-course-c02l/~0g)**\n- **[Classes and IDs](https://v2.scrimba.com/html-css-crash-course-c02l/~0h)**\n- **[Intro to the Box Model](https://v2.scrimba.com/html-css-crash-course-c02l/~0k)**\n- **[Margin and Padding](https://v2.scrimba.com/html-css-crash-course-c02l/~0l)**\n- **[Borders](https://v2.scrimba.com/html-css-crash-course-c02l/~0m)**\n\n### CSS\n\n*Cascading Style Sheets*, or CSS, is a programming language that was created to supplement HTML. As a *style sheet language*, CSS is the code that explains how a markup language, like HTML, should be presented. When used alongside HTML on a web page, CSS can add a variety of formatting, design, and style details.\n",
      "videoUrl": "",
      "codeExamples": [],
      "externalLinks": [],
      "quizzes": [],
      "_id": "687970c4a4ac7ef2a17a63ad"
    }
  ]
}