{
  "id": "687970c4a4ac7ef2a17a63b4",
  "lessonNumber": 10,
  "title": "## The Odin Project Links:",
  "status": "pending",
  "assignment": {
    "title": "Assignment for Lesson 10",
    "objective": "No objective specified",
    "expectedCapabilities": [],
    "instructions": [],
    "tasks": [
      {
        "taskNumber": 1,
        "title": "Task 1",
        "description": "### Get organized and write some code!\n - [ ] In your GitHub repository, if you have not yet merged your pull request from last week, merge your open lesson-9 pull request by going to the \"Pull Requests\" tab of your repository. \n - [ ] Click on your open pull request, then click on the green 'Merge Pull Request\" and confirm the merge. This will update your main branch with the work you did on your lesson-9 branch.\n - [ ] Open your code editor and, in the terminal, make sure you're on your main branch. If you're still on your lesson-9 branch, you can switch to your main branch by using the git command `git checkout main`.\n - [ ] Update your local main branch to include your lesson-9 work by pulling your changes from your GitHub repository main. Use the following git command in your terminal to do this: `git pull origin main`\n - [ ] Still in your terminal, create a new local branch to keep track of just the work you'll do for this assignment by running `git checkout -b lesson-10` in the terminal. Doing this also copies the lesson-9 work you merged to main and pulled to your local machine so now all your branches should be identical on your local machine.\n\n### Assignment: Task List / Deliverables\nYour site is probably looking good on your browser, but as you learned the majority of users use a mobile device or tablet to view sites.  Let's make your site look good on every device!\n**TIP:** When working with sizing, it's best to use percentages, REMs and EMs.. you can read more about those [here](https://www.linkedin.com/pulse/pixels-vs-em-rem-percent-when-why-use-each-milan-savov).  \n - [ ] Open your index.css file\n - [ ] Determine if you'd like to build your site mobile-first or desktop-first (meaning the code you have in there right now will be the default code for a phone or a desktop/laptop monitor)\n - [ ] Add comment notation to help keep yourself organized and make it easier to find your desktop/tablet/mobile style code sections\n - [ ] Based on if you decided to design mobile-first or desktop first, add your media queries for the other two device types.  Example: if you're designing mobile-first, you'll want to add a media query that handles devices that are tablet sized, and a media query that handles anything larger than the largest tablet size.\n - [ ] Make a minimum of two changes to at least three elements for each of your media queries.  Example: In your tablet media query, change the font size (1st change) and color (2nd change) of your headers (1st element), change the padding or margin (1st change) and background color (2nd change) of your unordered lists (2nd element), and change the font size (1st change) and font style (2nd change) of your name at the top of your page (3rd element)\n\n - [ ] STRETCH GOAL: Since we learned about grid layout this week, reformat one or both of your two flexbox sections (Experience or Connect) to be a grid layout instead to give yourself practice using grid.\n\nThe above are just suggestions/examples.  As in the past two lessons, we encourage you to make your site an expression of yourself!  Just keep in mind accessibility, because your awesomeness needs to be visible to everyone!  \n\n**_By the end of this lesson you should have at least two media queries defined in your index.css file and those media queries should be changing a minimum of two style properties across at least three of your html elements._**\n\n### Backup to the cloud\nOnce you've made the above changes to your css file, follow the below instructions to push a copy from your local machine like you did at the end of last assignment. Make sure your code gets copied to GitHub by adding changes to staging, committing the staged changes, and pushing them from your local machine to GitHub:\n - [ ] Check the status of the changes you just made (editing the index.css file) by running `git status` in your terminal\n - [ ] Stage all your changes for commit by running `git add .` in your terminal\n - [ ] Run `git status` again to see how things have changed. You should get a response indicating changes staged for commit.\n - [ ] Create a commit message for reference. You can use a different message if you wish. Run `git commit -m “responsiveness added\"`\n - [ ] Push these changes to your GitHub repository from your local computer by running `git push`\n\n### Submit Assignment\nNow let's make sure that lesson branch will be reviewed.  \n - [ ] Go to your GitHub repository page in your web browser now, and you should see a \"lesson-10 has a recent push\" notice with a green \"Compare & pull request\" button. Click that button\n - [ ] Feel free to put notes to yourself or notes for your reviewer in the description (be sure you're including any questions to your reviewer in your assignment submission form though!) and click the green \"Create pull request\" button.\n - [ ] Copy the address of your pull request page (should look like `https://github.com/yourUsername/name-classname/pull/5`) and paste it into your assignment submission form.\n\n### What next?\n- If you're on track with class, wait to get feedback and/or the email notice that your assignment review is complete before confirming and merging your pull request to the main branch.\n- If you're behind or are working ahead:\n  - if you're confident your work is accurate, merge your pull request and continue working through class.\n  - if you're not sure about your work this week, schedule a 1:1 session with a mentor and review your work together before merging.\n",
        "codeExample": "",
        "_id": "687970c4a4ac7ef2a17a63b6"
      }
    ],
    "submissionInstructions": "Please submit on time",
    "checklist": [],
    "checkForUnderstanding": []
  },
  "subsections": [
    {
      "subsectionOrder": 1,
      "title": "Lesson 10",
      "content": "You can either use the written Odin Project lessons or the video lessons in Scrimba.\n\nRemember to please go to each link in this list and read through the content on that page. If there are links you are redirected to as you read/work through the content, follow those links as well and read the content there too.\n\n### The Odin Project Links:\n- **[The Odin Project - Responsive Design](https://www.theodinproject.com/lessons/node-path-advanced-html-and-css-introduction-to-responsive-design)**\n- **[The Odin Project - Natural Responsiveness](https://www.theodinproject.com/lessons/node-path-advanced-html-and-css-natural-responsiveness)**\n- **[The Odin Project - Responsive Images](https://www.theodinproject.com/lessons/node-path-advanced-html-and-css-responsive-images)**\n- **[The Odin Project – Media Queries](https://www.theodinproject.com/lessons/advanced-html-and-css-media-queries)**\n- **[The Odin Project - Introduction to Grid](https://www.theodinproject.com/lessons/node-path-intermediate-html-and-css-introduction-to-grid)**\n- **[The Odin Project - Creating a Grid](https://www.theodinproject.com/lessons/node-path-intermediate-html-and-css-creating-a-grid)**\n- **[The Odin Project - Positioning Grid Elements](https://www.theodinproject.com/lessons/node-path-intermediate-html-and-css-positioning-grid-elements)**\n- **[The Odin Project - Advanced Grid Properties](https://www.theodinproject.com/lessons/node-path-intermediate-html-and-css-advanced-grid-properties)**\n\n### Scrimba Links:\n- **[Scrimba - Learn Responsive Web Design](https://v2.scrimba.com/learn-responsive-web-design-c029/~01)** - NOTE: Begin with the \"Starting to think responsively\" lesson since the fundamentals videos cover things you've learned in previous weeks.\n- **[Scrimba - Learn CSS Grid](https://v2.scrimba.com/learn-css-grid-c02k/~00)**\n\n### ADDITIONAL RESOURCES (same as the stretch goal last week):\n- **[CSS Grid Model guide](https://css-tricks.com/snippets/css/complete-guide-grid/)**\n",
      "videoUrl": "",
      "codeExamples": [],
      "externalLinks": [],
      "quizzes": [],
      "_id": "687970c4a4ac7ef2a17a63b5"
    }
  ]
}